---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAzimuthText
source: html/b52fde7a-daf7-56f4-34f1-20d4eea05f86.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAzimuthText Property

"Lighting azimuth text"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyLightingAzimuthText { get; }
```